#Первый семинар

#Задание на семинаре

#a = int(input("Введите число - a: "))


#b = int(input("Введите число - b:  "))

#if a ** 2 == b:
#    print(f"Число {b} является квадратом числа {a} ")
#elif b ** 2 == a:
#    print(f"Число {a} является квадратом числа {b}")
#else:
#    print("Тут квадратов нет")


#print("Вводите числа массива: ")
#array = []
##for i in range(5):
#    number = int(input())
#    array.append(number)
#print(array)

#max = 0
#for i in array:
#    if i > max:
#       max = i
#
#print(max)



#N = int(input("Введите число N:  "))

#for i in range(-N, N+1):
#    print(i)


#N = float(input("Введите дробное число: "))



#4. Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа.

#def Cal(N):

#    if N % 1 == 0:
#        print("Число не дробное")
#        N = float(input("Введите дробное число: "))
#        Cal(N)

#    else:
#        N = int(N % 1 * 10)
#        print(N)

#Cal(N)